In [37]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np
from numpy import NaN as NA

In [6]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})
df2 = DataFrame({'key':["a","b","d"],'data2':range(3)})

In [7]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [8]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [9]:
# DateFrame的合并操作merge
pd.merge(df1,df2) # 取了key值的交集

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [10]:
pd.merge(df1,df2,on='key') # 以key作为交集列

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [13]:
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})
df4 = DataFrame({'rkey':["a","b","d"],'data2':range(3)})

In [12]:
pd.merge(df3,df4) # MergeError: No common columns to perform merge on

MergeError: No common columns to perform merge on

In [14]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [15]:
# merge的各种连接
pd.merge(df1,df2,on="key",how='outer') # 外连接--》并集

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [16]:
pd.merge(df1,df2,on="key",how='left') # 左连接--》取df1中所有数据，df2中有就取没有填充NaN

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [18]:
pd.merge(df1,df2,on="key",how='right') # 左连接--》取df2中所有数据，df1中有就取没有填充NaN

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

In [19]:
# series数据的连接
s1 = Series([0,1],index=list('ab'))
s2 = Series([2,3,4],index=list('cde'))
s3 = Series([5,6],index=list('fg'))

In [21]:
# 最简单的拼接
result = pd.concat([s1,s2,s3])
result

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [22]:
type(result)

pandas.core.series.Series

In [24]:
# 将多个series拼接成一个dataframe，即一个series就是dataframe一列数据
# 数据规整化合并数据集
df_concat = pd.concat([s1,s2,s3],axis=1)
df_concat

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [25]:
# 是对值进行运算
s1*5

a    0
b    5
dtype: int64

In [27]:
s4 = pd.concat([s1*5,s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [28]:
pd.concat([s1,s4],axis=1) # 按列添加取全集

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [29]:
# 取交集
pd.concat([s1,s4],axis=1,join="inner")

   0  1
a  0  0
b  1  5

In [30]:
# 利用concat生成层次化缩影数据结构
re = pd.concat([s1,s2,s3],keys=["one","two","three"])

In [31]:
type(re)

pandas.core.series.Series

In [32]:
re # 这个是具有层次化的数据结构

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [35]:
# 使用
re['one']['a']

0

In [40]:
a = Series([NA,2.5,NA,3.5,4.5,NA],index=list("fedcba")) 
b = Series(np.arange(len(a)),dtype=np.float64,index=list("fedcba"))
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [41]:
pd.concat([a,b]) # 重叠索引就会出现这种不想出现的问题

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [44]:
# 用其中一个series为另外一个series打补丁；我缺的你补上，我不缺的你不用管
res1 = b[:-2]
res2 = a[2:]
res1

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [45]:
res2

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [47]:
res_ab = res1.combine_first(res2)
res_ab

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [53]:
df1 = DataFrame({
    "a":[1,NA,5,NA],
    "b":[NA,2,NA,6],
    "c":range(2,18,4)
})
df2 = DataFrame({
    "a":[5,4,NA,3,7],
    "b":[NA,3,4,6,8]
})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [54]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN